import { ReviewsListType } from '../types/ReviewsListType';

const dataReviews: ReviewsListType = {
    list: [
        {
            id: 1,
            title: 'Шкаф',
            work: 'Весь комплекс услуг',
            content: 'С самого начала общения я была приятно удивлена его профессионализмом и вниманием к моим потребностям. Он внимательно выслушал мои пожелания по дизайну и предложил несколько вариантов решений. С самого начала общения я была приятно удивлена его профессионализмом и вниманием к моим потребностям. Он внимательно выслушал мои пожелания по дизайну и предложил несколько вариантов решений. С самого начала общения я была приятно удивлена его профессионализмом и вниманием к моим потребностям. Он внимательно выслушал мои пожелания по дизайну и предложил несколько вариантов решений.',
            date: '2024-05-20T15:30:00',
            rating: 4,
            user: {
                id: 2,
                name: 'Жанкожа',
                surname: 'Бободжонов',
                picture: 'https://placehold.co/600x600',
            },
            gallery: [
                {
                    id: 1,
                    title: 'Заголовок изображения',
                    caption: 'Подпись к изображению',
                    link: 'https://placehold.co/600x600',
                },
                {
                    id: 2,
                    title: 'Заголовок изображения',
                    caption: 'Подпись к изображению',
                    link: 'https://placehold.co/600x600',
                },
                {
                    id: 3,
                    title: 'Заголовок изображения',
                    caption: 'Подпись к изображению',
                    link: 'https://placehold.co/600x600',
                },
            ],
        },
        {
            id: 2,
            title: 'Шкаф',
            work: 'Весь комплекс услуг',
            content: 'С самого начала общения я была приятно удивлена его профессионализмом и вниманием к моим потребностям. Он внимательно выслушал мои пожелания по дизайну и предложил несколько вариантов решений. С самого начала общения я была приятно удивлена его профессионализмом и вниманием к моим потребностям. Он внимательно выслушал мои пожелания по дизайну и предложил несколько вариантов решений. С самого начала общения я была приятно удивлена его профессионализмом и вниманием к моим потребностям. Он внимательно выслушал мои пожелания по дизайну и предложил несколько вариантов решений.',
            date: '2024-05-20T15:30:00',
            rating: 4,
            user: {
                id: 2,
                name: 'Жанкожа',
                surname: 'Бободжонов',
                picture: 'https://placehold.co/600x600',
            },
            gallery: [
                {
                    id: 1,
                    title: 'Заголовок изображения',
                    caption: 'Подпись к изображению',
                    link: 'https://placehold.co/600x600',
                },
                {
                    id: 2,
                    title: 'Заголовок изображения',
                    caption: 'Подпись к изображению',
                    link: 'https://placehold.co/600x600',
                },
                {
                    id: 3,
                    title: 'Заголовок изображения',
                    caption: 'Подпись к изображению',
                    link: 'https://placehold.co/600x600',
                },
            ],
        },
        {
            id: 3,
            title: 'Шкаф',
            work: 'Весь комплекс услуг',
            content: 'С самого начала общения я была приятно удивлена его профессионализмом и вниманием к моим потребностям. Он внимательно выслушал мои пожелания по дизайну и предложил несколько вариантов решений. С самого начала общения я была приятно удивлена его профессионализмом и вниманием к моим потребностям. Он внимательно выслушал мои пожелания по дизайну и предложил несколько вариантов решений. С самого начала общения я была приятно удивлена его профессионализмом и вниманием к моим потребностям. Он внимательно выслушал мои пожелания по дизайну и предложил несколько вариантов решений.',
            date: '2024-05-20T15:30:00',
            rating: 4,
            user: {
                id: 2,
                name: 'Жанкожа',
                surname: 'Бободжонов',
                picture: 'https://placehold.co/600x600',
            },
            gallery: [
                {
                    id: 1,
                    title: 'Заголовок изображения',
                    caption: 'Подпись к изображению',
                    link: 'https://placehold.co/600x600',
                },
                {
                    id: 2,
                    title: 'Заголовок изображения',
                    caption: 'Подпись к изображению',
                    link: 'https://placehold.co/600x600',
                },
                {
                    id: 3,
                    title: 'Заголовок изображения',
                    caption: 'Подпись к изображению',
                    link: 'https://placehold.co/600x600',
                },
            ],
        },
    ],
    meta: {
        pageCount: 2,
        pageNow: 2,
        pageSize: 3,
        total: 10,
    },
};

export {
    dataReviews,
};
